using Cheshan.Collection.Shop.Database.Abstract;
using Cheshan.Collection.Shop.Database.Database;
using Cheshan.Collection.Shop.Database.Entities;
using Microsoft.EntityFrameworkCore;

namespace Cheshan.Collection.Shop.Database.Repositories
{
    public class BrandRepository : IBrandRepository
    {
        private readonly DataContext _dataContext;

        public BrandRepository(DataContext dataContext)
        {
            _dataContext = dataContext ?? throw new ArgumentNullException(nameof(dataContext));
        }

        public async Task<BrandEntity?> GetAsync(string name)
        {
            //await CreateAsync("ACNE STUDIOS", "", "acne-studios-logo.png");

            //await CreateAsync("ALTEA", "Основатель текстильной династии Джузеппе Сартори (Giuseppe Sartori) открыл свой первый магазин по продаже галстуков и шарфов в 1892 г. в Милане. Последующее поколение семьи Сартори расширило семейное дело. Сегодня Altea выпускает коллекции изысканной женской и мужской одежды, аксессуаров и изделий из кожи. В компании Altea свято чтут традиции, заложенные еще Джузеппе Сартори. Как и сто лет назад, в изготовлении одежды используются лучшие ткани и дорогая фурнитура. Новый взгляд на высокие стандарты итальянского качества, креативное сочетание цветов и принтов, творческий подход к трактовке современной моды — все это главные слагаемые успеха Altea.", "altea-logo.png");

            //await CreateAsync("DOMREBEL", "Бренд Domrebel — это канадская компания, специализирующаяся на производстве стильной одежды и аксессуаров с уникальными принтами и дизайном. Они известны своими оригинальными и высококачественными изделиями, которые выделяются на фоне других брендов. Одежда Domrebel сочетает в себе рок-н-ролльную эстетику с элементами моды и искусства. Бренд Domrebel пользуется популярностью среди любителей стильной и оригинальной одежды, а также среди музыкантов, художников и людей, предпочитающих неповторимый и индивидуальный стиль.", "domrebel-logo.png");

            //await CreateAsync("MooRER", "MooRER — итальянский модный дом, славящийся выпуском качественной верхней одежды для мужчин и женщин. Модельеры бренда регулярно радуют ценителей удобных и практичных пуховиков стильными фасонами. Сегодня компания выпускает пуховики, куртки, парки, плащи, жилеты. В пошиве используется натуральный гусиный пух и перо, непродуваемые ткани, 100% кожа и шерсть, трикотаж, шелк, а также разнообразные декоративные элементы.", "moorer-logo.png");

            //await CreateAsync("Sara Roka", "В одежде дизайнер Sara Roka объединяет свои представления о расслабленной итальянской эстетике и знаковой для американского стиля практичности и функциональности. Площадкой для творческих экспериментов стала классическая белая рубашка, словно позаимствованная из мужского гардероба. Ее перевоплощают в романтические платья с расклешенными подолами, украшенные красочными узорами, плиссировкой, драпировкой. За счет комбинации в одной вещи принтованных и однотонных тканей многие модели выглядят как соединенные вместе рубашка и юбка. В ассортименте бренда есть и широкие пояса, длины которых хватает, чтобы завязать объемный бант.", "sararoka-logo.png");

            //await CreateAsync("Kiton", "Бренд Kiton был создан в Арцано, провинции Неаполя, в 1968 году. Компанию основал Чиро Паоне, философия которого ориентирована на высокое качество: лучшее из лучшего + 1. Этот девиз всегда являлся лозунгом компании. Всегда ассоциированная с неподвластной времени элегантностью, компания Kiton является символом в мире высокой моды, где каждый предмет одежды является изделием ручной работы и выполнен с любовью, радостью и безупречным качеством.", "kiton-logo.png");

            //await CreateAsync("KHRISJOY", "KHRISJOY — итальянский бренд верхней одежды, вдохновленный oversize, темой спорта и эстетикой street style. Для Khrisjoy характерны объемные силуэты и нетипичная для верхней одежды цветовая гамма. Модели из женских коллекций бренда шьют из непродуваемого нейлона. Особое внимание обращает на себя широкая цветовая гамма: от ярких солнечных оттенков до блеска металла. стиле граффити, сверкающие пайетки или переливающееся металлизированное напыление. Дерзкий и динамичный KHRISJOY уже покорили столицы моды и стал объектом желания по всему миру.", "khrisjoy-logo.png");

            //await CreateAsync("Karl Lagerfeld", "Бренд Karl Lagerfeld — это нечто большее, чем коллекции одежды, обуви и аксессуаров, сочетающие парижскую эстетику с непринужденностью стиля рок-шик. Это возможность прикоснуться к искусству и исследовать мир Лагерфельда, его острого ума и уникального видения. Вслушайтесь в слова человека, который изменил мир fashion и предопределил его развитие: \"Мода – это отношение, а не элемент одежды\".", "karl-lagerfeld-logo.png");

            //await CreateAsync("Jacquemus", "", "jacquemus-logo.png");

            //await CreateAsync("Jil Sander", "Немецкий модельер и дизайнер одежды. Сотрудничала с множеством известных брендов одежды, таких как Prada, Uniqlo и Puma. За свой собственный почерк, которому оставалась верна всю свою карьеру получила неофициальный титул «Королевы минимализма» в модных кругах.", "jil-sander-logo.png");

            //await CreateAsync("Panicale", "Panicale — фамильный бренд кашемировых изделий из Италии, созданный в 1964 году семейной парой Марио и Сольери Паникале. Марка, под которой в Умбрии в соответствии с канонами традиционного ремесленного производства изготавливается трикотаж из высококачественного кашемира, поставляемый по всему миру компанией Panicale S.r.l. Философия марки – красота в простоте.", "panicale-logo.png");

            //await CreateAsync("Peserico", "Итальянский бренд Peserico — это воплощение страсти к высокой моде и уважения к традициям. Сила коллекций Peserico заключается в качественном производстве, отличающемся высоким мастерством и особой тщательностью к деталям. Компания всегда была верна произведенному в Италии продукту, в котором представлены лучшие изделия, пошитые с акцентом на идеальную посадку.В Peserico создание каждого изделия, шаг за шагом сопровождающееся проверкой качества, основано на профессионализме высококлассных мастеров.", "peserico-logo.png");

            //await CreateAsync("Premiata", "Premiata — символ итальянской марки. Обладая более чем 100-летним опытом изготовления итальянской обуви высшего качества, в настоящее время Premiata находится в авангарде современной моды. Экспериментируя с материалами и дизайнами, бренд выпускает кроссовки и ботинки в стиле ретро, предлагая разнообразную цветовую палитру.", "premiata-logo.png");

            //await CreateAsync("Palm Angels", "Сочетание в одной модели одежды премиального качества и повседневной практичности — это отличительная черта всех коллекций Palm Anges. Молодой бренд, основанный в 2015 году, мгновенно обрел популярность сначала в США, а потом и в странах Юго-восточной Азии.", "palm-angels-logo.png");

            //await CreateAsync("Giuseppe Zаnotti", "Giuseppe Zаnotti - итальянский бренд обуви и аксессуаров класса люкс, созданный выдающимся дизайнером Джузеппе Занотти. Сегодня бренд выпускает полные коллекции как мужской, так и женской обуви, сумки, кожаные аксессуары верхнюю и базовую одежду.Сегодня Giuseppe Zаnotti — это не только всемирно известный, но и излюбленный бренд знаменитостей. Среди звездных поклонниц Шарлиз Терон, Дженнифер Лопес, Мадонна, Кайли Миноуг и другие.", "giuseppe-zаnotti-logo.png");

            //await CreateAsync("Fendi", "Fendi — итальянский дом моды класса люкс, производящий мех, готовую одежду, изделия из кожи, обувь, парфюмерию, очки, часы и аксессуары. Основанная в Риме в 1925 году, компания Fendi известна своим мехом, меховыми аксессуарами и изделиями из кожи.", "fendi-logo.png");

            //await CreateAsync("Fabiana Filippi", "Сегодня бренд Fabiana Filippi представлен в 30 странах мира и выделяется идеальным балансом качества и стиля своей продукции.Стиль Fabiana Filippi — это ощущение вечной красоты, становящееся уникальным благодаря личности обладательницы вещи. Fabiana Filippi — это элегантность вне времени.Благодаря сочетаемости моделей между собой по цвету и стилю легко собирать разные образы. В коллекциях преимущественно используются базовые цвета, которые легко впишутся в любой гардероб и внесут в него благородный шик.", "fabiana-filippi-logo.png");

            //await CreateAsync("Etro", "Итальянский Дом моды ETRO был основан в 1968 году Джироламо Этро — знатоком живописи и большим любителем старинных тканей.Имя ETRO стало синонимом слова «стиль». Стиль жизни, основанный на качестве и эстетичном изяществе, утонченности и изысканности. Общая направленность марки — природная страсть к истории и путешествиям, которая стала лейтмотивом всех выпускающихся линий Gimmo Etro. Эта любовь к экзотике и культуре мотивирует его тщательный поиск с тех пор, как дизайнер с обычной отделки текстиля решил перейти к полноценной одежде и основал свое предприятие.Сегодня Etro остается всемирно известным брендом и одной из немногих компаний, работающих с этническими узорами.", "etro-logo.png");

            //await CreateAsync("Ermanno Schervino", "Ermanno Schervino (Эрманно Шервино) — итальянская марка, которая делает вещи безупречного качества, демонстрирует итальянскую элегантность при откровенной чувственности и романтизме. Вещи этой марки из лучших тканей с универсальными фасонами, искусным кроем и роскошной отделкой. Экзотическая кожа, мех, металлизированные элементы, ручной способ изготовления — всё это обеспечивает моделям одежды большой успех и популярность, как среди женщин, так и среди мужчин.", "ermanno-schervino-logo.png");

            //await CreateAsync("Dirk Bikkembergs", "Бренд Dirk Bikkembergs на сегодняшний день сочетает в себе силу, храбрость, мужественность, спортивный внешний облик и безупречный писк элегантности. Дизайнер данного бренда не может сравниться ни с кем, и его работы не сможет повторить ни один другой художник, потому что он вкладывает всего себя в создании трендовой одеждыи аксессуаров. Модельер этой компании всегда отшучивается, что он с давних времен женат на моде, и свадьба у них состоялась.", "dirk-bikkembergs-logo.png");

            //await CreateAsync("Cult Gaia", "В одежде основательница Cult Gaia воплощает концепцию этичного отношения к окружающей среде. Это проявляется как в использовании экологичных материалов, так и в безопасных технологиях производства. Также Жасмин мечтает перевернуть представления о сексуальности, как о пошлости. Вместо обтянутых силуэтов она предлагает драпировки, широкие брюки и подолы с длинной бахромой. Но эти образы нельзя назвать бесформенными, наоборот, вдохновленная японской школой минимализма, Жасми Лариан создает подтянутые, собранные луки, слегка напоминающие оригами.", "cult-gaia-logo.png");

            //await CreateAsync("BY FAR", "Основательницы бренда Валентина Безуханова, Сабина Гешева и Деница Бумбарова.Эстетика бренда во многом отсылает к минимализму 90-х (Y2K): маленькие сумки с короткой ручкой, ботильоны из гладкой кожи, отсутствие деталей и сложно декора, монохром, пастельные или яркие цвета. Чтобы носить все эти аксессуары не нужен особый повод и аутфит — девушки создали предметы, которых им самим давно не хватало. Коллекции изготавливаются вручную на семейной фабрике в Болгарии.", "by-far-logo.jpg");

            //await CreateAsync("Bottega Veneta", "Ее продуктовые линейки для мужчин и женщин включают готовую одежду, сумки, обувь, аксессуары, ювелирные изделия и парфюмерию. Bottega Veneta была основана в 1966 году в Виченце, Венето, Микеле Таддеи и Ренцо Дзенджаро. Его плетение из кожи Intrecciato стало мгновенным хитом.", "bottega-veneta-logo.png");

            //await CreateAsync("Autry", "Культовый бренд Autry возвращается спустя 20 лет. Марка была основана в 1982 году в Далласе и быстро обрела популярность. Всего за несколько лет кроссовки Autry стали самой продаваемой спортивной обувью во всей Северной Америке. Про Autry писали ведущие спортивные СМИ. В 1985 году модель Medalist была названа Tennis Magazine лучшими кроссовками, как с точки зрения дизайна, так и технических характеристик. Autry, как никакой другой бренд, воплощает атмосферу 80-х. Благодаря своему вневременному дизайну, кроссовки Autry легко сочетаются с разными стилями.", "autry-logo.png");

            //await CreateAsync("Aquazzura", "", "aquazzura-logo.png");

            //await CreateAsync("Balossa", "", "balossa-logo.png");

            //await CreateAsync("Doucal's", "", "doucals-logo.png");

            //await CreateAsync("John Hatter&Co", "", "john-hatter&co-logo.png");

            //await CreateAsync("Giuseppe di Morabito", "Марку Giuseppe di Morabito основал в недалеком 2015 году Джузеппе ди Морабито, которому всего 27 лет. Однако юность лет не помешала талантливому дизайнеру четко определиться с концепцией — китчевые и не знающие меры 1980-е, помноженные на традиции итальянского портновского искусства. Результат: в коллекциях Giuseppe di Morabito всегда найдется идеальное платье для вечеринки. И не только: пиджаки с пышными рукавами, «винтажные» юбки и расшитые пайетками топы удаются Джузеппе тоже весьма неплохо.", "giuseppe-di-morabito-logo.png");

            var brand = await _dataContext.Brands.FirstOrDefaultAsync(x => x.Name.ToLower().Equals(name));

            return brand;
        }

        public async Task<IEnumerable<BrandEntity>> GetAllBrandsAsync()
        {
            return await _dataContext.Brands.ToListAsync();
        }

        private async Task CreateAsync(string name, string description, string logo)
        {
            var brand = new BrandEntity
            {
                Id = Guid.NewGuid(),
                Name = name,
                Description = description,
                Logo = logo
            };

            await _dataContext.AddAsync(brand);

            await _dataContext.SaveChangesAsync();
        }
    }
}
